package com.project.database.parser.parserBigunets;

public class Enums {
    public enum BigunElement {
        SHEET_ID("ЗАЛІКОВО-ЕКЗАМЕНАЦІЙНИЙ ЛИСТОК № (.*?)\\s*\\n"),
        EDU_LEVEL("Освітній рівень\\s*(.*?)\\s*\\n"),
        FACULTY("[\\s\\r\\n]+(.*?)\\s*Рік"),
        STUDY_YEAR("Рік навчання\\s*(.*?)\\s*Група"),
        GROUP("Група\\s*(.*?)\\s*\\n"),
        SUBJECT("Дисципліна\\s*(.*?)\\s*\\n"),
        TERM("Семестр\\s*(.*?)\\s+"),
        ZALIK_BALI("Залікові бали\\s*(.*?)\\s*Направлення"),
        DUE_TO("Направлення дійсне до\\s+«\\s*(.*?)\\s*»\\s+(.*?)\\s+(.+)\\s+р."),
        POSTPONE_REASON("Причина перенесення\\s*(.*?)\\s*\\n"),
        FORM_CONTROL("Форма контролю:\\s*(.*?)\\s*\\."),
        DATE("Дата\\s+«\\s*(.*?)\\s*»\\s+(.*?)\\s+(.+)\\s+р."),
        TUTOR_INFO("(.*?)[\\s\\n\\r]+Прізвище, ім’я, по батькові екзаменатора"),
        //        STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(.+?) (\\d*?) (\\d*?) (\\*?) ([\\D\\r\\n\\s]*?) (\\S?)"),
        //STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(І[\\s\\r\\n]*\\d+/\\d+[\\s\\r\\n]*бп|мп)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ\\s]*?)[\\s\\r\\n]+([\\S]?)  [\\r\\n]"),
        //STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(І[\\s\\r\\n]*\\d+/\\d+[\\s\\r\\n]*бп|мп)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ\\s\\r\\n]*?)[\\s\\r\\n]+([\\D]?)[\\s]*[\\r\\n]+"),
        STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(І[\\s\\r\\n]*\\d+/\\d+[\\s\\r\\n]*бп|мп)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ\\s]*?)[\\s\\r\\n]+([\\S]?)  [\\r\\n]*"),
        //STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(І[\\s\\r\\n]*\\d+/\\d+[\\s\\r\\n]*бп|мп)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*?[\\r\\s\\n]*[абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*?)[\\s\\r\\n]+([ABCDEF]?)[\\s]*[\\r\\n]+"),
        //Student("(\\d+) ([\\D]+)[\\s\\r\\n]+([\\D]+)[\\s\\r\\n]+([\\D])+[\\s\\r\\n]+(.*?) (\\d+) (\\d+) (\\d+) (.*?) (.)"),
        FACULTY_HEAD("Декан факультету\\s+(.+)");

        public final String regex;

        BigunElement(String label) {
            this.regex = label;
        }
    }


}
