package com.project.database.parser.parserStatement;

public class Enums {
    public enum Errors {
        SHEET_ID_ERROR("Неправильний номер відомості"),
        EDU_LEVEL_ERROR("Неправильний освітній рівень"),
        FACULTY_ERROR("Не введений факультет"),
        STUDY_YEAR_ERROR("Неправильний рік навчання"),
        GROUP_ERROR("Неправильний номер групи"),
        SUBJECT_ERROR("Не введена дисципліна"),
        TERM_ERROR("Неправильно введений семестр"),
        ZALIK_BALI_ERROR("Неправильно введені залікові бали"),
        FORM_CONTROL_ERROR("Неправильно введена форма контролю"),
        DATE_ERROR("неправильно введена дата"),
        TUTOR_FULL_NAME_ERROR("Не вказано ПІБ викладача"),
        //        STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(.+?) (\\d*?) (\\d*?) (\\*?) ([\\D\\r\\n\\s]*?) (\\S?)"),
        //?  STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(.+?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ\\s]*?)[\\s\\r\\n]+([\\S]?)  [\\r\\n]"),
        //Student("(\\d+) ([\\D]+)[\\s\\r\\n]+([\\D]+)[\\s\\r\\n]+([\\D])+[\\s\\r\\n]+(.*?) (\\d+) (\\d+) (\\d+) (.*?) (.)"),
        PRESENT_NUMBER_ERROR("Неправильно введена кількість присутніх студентів"),
        ABSENT_NUMBER_ERROR("Неправильно введена кількість відсунтніх студентів"),
        FAILURE_NUMBER_ERROR("Неправильно введена кількість недопущенних студентів"),
        FACULTY_HEAD("Не введено декана");
        // TOdo
        private final String message;

        Errors(String message) {
            this.message = message;
        }
    }

    public enum Element {
        SHEET_ID("ЗАЛІКОВО-ЕКЗАМЕНАЦІЙНА ВІДОМІСТЬ № (.*?)\\s*\\n"),
        EDU_LEVEL("Освітній рівень\\s*(.*?)\\s*\\n"),
        FACULTY("[\\s\\r\\n]+(.*?) Рік"),
        STUDY_YEAR("Рік навчання\\s*(.*?)\\s*Група"),
        GROUP("Група\\s*(.*?)\\s*\\n"),
        SUBJECT("Дисципліна\\s*(.*?)\\s*\\n"),
        TERM("Семестр\\s*(.*?)\\s+"),
        ZALIK_BALI("Залікові бали\\s*(.*?)\\s*\\n"),
        FORM_CONTROL("Форма контролю:\\s*(.*?)\\s*\\."),
        DATE("Дата\\s+«\\s*(.*?)\\s*»\\s+(.*?)\\s+(.+)\\s+р."),
        TUTOR_INFO("(.*?)[\\s\\n\\r]+Прізвище, ім’я, по батькові екзаменатора"),
        //        STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(.+?) (\\d*?) (\\d*?) (\\*?) ([\\D\\r\\n\\s]*?) (\\S?)"),
        //STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(І[\\s\\r\\n]*\\d+/\\d+[\\s\\r\\n]*бп|мп)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ\\s]*?)[\\s\\r\\n]+([\\S]?)  [\\r\\n]"),
        //STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(І[\\s\\r\\n]*\\d+/\\d+[\\s\\r\\n]*бп|мп)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ\\s\\r\\n]*?)[\\s\\r\\n]+([\\D]?)[\\s]*[\\r\\n]+"),
        STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(.+?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ\\s]*?)[\\s\\r\\n]+([\\S]?)  [\\r\\n]"),
        //STUDENT("(\\d+) ([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]+)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*)[\\s\\r\\n]+(І[\\s\\r\\n]*\\d+/\\d+[\\s\\r\\n]*бп|мп)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+(\\d*?)[\\s\\r\\n]+([абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*?[\\r\\s\\n]*[абвгґдеєжзиіїйклмнопрстуфхцчшщьюяАБВГҐДЕЄЖЗИІЇЙКЛМНОПРСТУФХЦЧШЩЬЮЯ]*?)[\\s\\r\\n]+([ABCDEF]?)[\\s]*[\\r\\n]+"),
        //Student("(\\d+) ([\\D]+)[\\s\\r\\n]+([\\D]+)[\\s\\r\\n]+([\\D])+[\\s\\r\\n]+(.*?) (\\d+) (\\d+) (\\d+) (.*?) (.)"),
        PRESENT_NUMBER("Кількість студентів на екзамені \\/тезі \\/заліку\\s+(\\d+)"),
        ABSENT_NUMBER("Кількість студентів, які не з’явились на екзамен \\/тезу \\/залік\\s+(\\d+)"),
        FAILURE_NUMBER("Кількість студентів, недопущених до екзамену \\/тези \\/заліку\\s+(\\d+)"),
        FACULTY_HEAD("Декан факультету\\s+(.+)");

        public final String regex;

        Element(String label) {
            this.regex = label;
        }
    }


}
